import { Exercise } from 'src/schemas/exercise.schema';

export const data: Exercise[] = [
  {
    exercise_name: '플렛 벤치프레스',
    target: '가슴',
    description:
      '가장 기본이 되는 벤치프레스의 종류이며 흔히 알려져 있는 3대 운동 중 하나입니다.\n수평으로 고정된 벤치에 누워 발을 땅에 붙이고 바벨을 가슴위에서 들었다 놨다 하는 운동법입니다.가슴 대흉근,어깨 삼각근, 삼두근 등 상체 전반적인 크기를 키우는 운동이고 발을 땅에 붙여 몸이 흔들리는 것을 막고 중심을 유지하기 위해 코어 근육과 다리 근육또한 개입이됩니다.\n허리를 아치모양으로 만들어 견갑골을 고정하고 어깨를 잘 고정해 주어야 합니다.바벨을 떨어뜨리거나 하면 큰 부상으로 이어질 수도 있으니 작은 무게 부터 시작하시는 것을 권장합니다.',
    links: [],
    first_aid: [],
  },
  {
    exercise_name: '인클라인 벤치프레스',
    target: '가슴',
    description:
      '인클라인 벤치프레스는 가슴 위쪽과 쇄골 위에서 운동을 수행하기 때문에 플렛 벤치프레스 보다 윗가슴에 더 많은 자극을 주기 위한 방법입니다.\n몸을 어느정도 세운 후에 운동을 하기 때문에 허리의 아치와 어깨를 잘 고정시킨 상태에서 하지 않으면 윗가슴이 아닌 승모와 어깨를 잘못 사용하여 들게되니 자세에 유의해야합니다.\n플렛 벤치프레스 자세를 충분히 익힌 후 수행하시길 권장합니다.',
    links: [],
    first_aid: [],
  },
  {
    exercise_name: '디클라인 벤치프레스',
    target: '가슴',
    description:
      '디클라인 벤치프레스는 머리가 있는쪽의 벤치가 기울어 진행하며 하단 가슴 근육에 자극을 더 주게 됩니다.\n처음 진행하시는 입문자라면 디클라인 덤벨프레스 보다는 이 운동 방법을 권장드립니다.',
    links: [],
    first_aid: [],
  },
  {
    exercise_name: '머신 벤치프레스',
    target: '가슴',
    description:
      '플렛 벤치프레스가 익숙하지 않으신 입문자라면 접근하기 수월한 운동입니다.\n플렛 벤치프레스와는 다르게 팔이 밀어내는 방향이 고정적이기 때문에 동작범위는 좁을 수 있으나 안정하기 때문에 플렛 벤치프레스에 입문하시는 분에게 권장드립니다.',
    links: [],
    first_aid: [],
  },
  {
    exercise_name: '머신 인클라인 벤치프레스',
    target: '가슴',
    description:
      '인클라인 벤치프레스가 익숙하지 않으신 입문자라면 접근하기 수월한 운동입니다.\n인클라인 벤치프레스와는 다르게 팔이 밀어내는 방향이 고정적이기 때문에 동작범위는 좁을 수 있으나 안정하기 때문에 인클라인 벤치프레스에 입문하시는 분에게 권장드립니다.',
    links: [],
    first_aid: [],
  },
  {
    exercise_name: '머신 디클라인 벤치프레스',
    target: '가슴',
    description:
      '디클라인 벤치프레스가 익숙하지 않으신 입문자라면 접근하기 수월한 운동입니다.\n디클라인 벤치프레스와는 다르게 팔이 밀어내는 방향이 고정적이기 때문에 동작범위는 좁을 수 있으나 안정하기 때문에 디클라인 벤치프레스에 입문하시는 분에게 권장드립니다.',
    links: [],
    first_aid: [],
  },
  {
    exercise_name: '덤벨프레스',
    target: '가슴',
    description:
      '가슴에 전체적으로 자극을 주는 운동입니다.\n고정적이지 않고 자유로운 가동범위를 가지고 있기 때문에 이완과 수축에 제한을 받지 않으며, 플렛 벤치프레스보다 피니쉬 동작에 더 수축할 수 있습니다.\n각도에 따라 상부/중부/하부 다양하게 자극을 줄 수 있습니다.\n익숙하지 않으신 분이라면 안정적으로 받춰주는 기구가 없기 때문에 부상에 우려가 있으므로 무게를 낮게 시작하시는 것을 권장드립니다.',
    links: [],
    first_aid: [],
  },
  {
    exercise_name: '덤벨플라이',
    target: '가슴',
    description:
      '주동근,대흉근 상부 내측을 자극하는 운동입니다.\n대흉근 근육을 뚜렷하게 만들어주며, 완성도 있게 가슴라인을 만들어 주는 운동입니다. 각도에 따라 상부/중부/하부 다양하게 자극을 줄 수 있습니다.',
    links: [],
    first_aid: [],
  },
  {
    exercise_name: '덤벨 풀오버',
    target: '가슴',
    description:
      '대흉근 발달에 도움을 주는 운동입니다.\n대흉근에 자극을 주는 만큼 광배근에도 많은 자극을 주기 때문에 가슴-등 운동으로 엮어서 분류하기도 합니다.',
    links: [],
    first_aid: [],
  },
  {
    exercise_name: '펙덱 플라이',
    target: '가슴',
    description:
      '기구를 사용하는 운동이기 때문에 안정적으로 할 수 있는 운동입니다.\n크게 두가지로 나뉠 수 있으며, 팔을 넓게 벌려 진행하거나 팔꿈치를 직각으로 하여 흔들림 없이 진행할 수 있습니다.',
    links: [],
    first_aid: [],
  },
  {
    exercise_name: '케이블 크로스오버',
    target: '가슴',
    description:
      '가슴 운동 중 가장 자유도가 높아 가동범위가 매우 자유로우며 대흉근 발달에 많은 도움을 주는 운동입니다.\n하지만 제대로 된 자세로 해야만 자극이 오기 때문에 입문자에게는 어려운 운동입니다.',
    links: [],
    first_aid: [],
  },
  {
    exercise_name: '체스트프레스',
    target: '가슴',
    description:
      '대흉근 발달과 삼각근,삼두근 강화에 도움을 주며 머신으로 할 수 있는 운동이기 때문에 입문자도 쉽게 할 수 있는 운동입니다.\n벤치프레스가 부담스럽다면 이 운동으로 가슴근육을 발달시켜 주시는걸 권장드립니다.',
    links: [],
    first_aid: [],
  },
  {
    exercise_name: '딥스',
    target: '가슴',
    description:
      '대흉근 하부에 자극을 주는 운동이며, 입문자라면 디클라인 벤치프레스 보다는 이 운동을 꾸준히 하여 횟수를 늘려나가는것을 권장합니다.\n또한 과하게 내려오는 동작으로 진행시 회전근에 무리가 갈 수 있으므로 조절해가면서 운동하는 것을 권장드립니다.',
    links: [],
    first_aid: [],
  },
];
